hackerrank-proj/app/graphql/resolvers/create_link.rb

INSERT INTO "links" ("url", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["url", "google.com"], ["description", "Best search engine in the world!"], ["created_at", "2019-01-14 01:26:45.270343"], ["updated_at", "2019-01-14 01:26:45.270343"]]
---
    def call(_obj, args, _ctx)
      Link.create!(
        description: args[:description],
        url: args[:url],
      )